app/Controllers/Pedidos.php

SELECT *
FROM `pedidos`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `pedidos`
---
    public function index()
    {
        $pedidos = $this->PedidoModel->paginate(20);

SELECT *
FROM `produtos`
---
    public function cadastroPedido()
    {
        $produtos = $this->ProdutoModel->findAll();

SELECT *
FROM `produtos`
---
    public function editarPedido($id)
    {
        $produtos = $this->ProdutoModel->findAll();

SELECT *
FROM `pedidos`
WHERE `id` = '12'
 LIMIT 1
---
    public function excluirPedido($id)
    {
        $this->PedidoModel->where('id', $id)->delete();