app/Controllers/Produtos.php

    public function index()
    {
        $produtos = $this->ProdutoModel->paginate(20);
---
SELECT *
FROM `produtos`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `produtos`

    public function verProduto($id)
    {
        $produto = $this->ProdutoModel->where('id', $id)->first();
---
SELECT *
FROM `produtos`
WHERE `id` = '1'
 LIMIT 1